#!/usr/bin/env python3

# --------------- комментарий 72 символа -------------------------------
# ----------------------- код 79 символов -------------------------------------

# Задание:
"""
Скрипт-настройка для всего проекта.
Начало: 29 мая 2024 г. 11:54.
Обновлена: 29 мая 2024 г. 11:54."""

# Версия скрипта.  
version = '0.1'

# Планирование разработки:
 
# Выполнено в ver. 0.1:
"""
1. Сделан набросок файла с настройками.
2. Добавлено имя БД.
3. Добавлен размер кэша по умолчанию."""

# План работ на ver.0.X:
""" """

DB_FILENAME = 'hoc_database.db'	# Название базы данных.
CACHE_SIZE_DEFAULT = 100		# Глубина кэша по умолчанию.